# Расписание
#* ЧЕТНАЯ НЕДЕЛЯ
EVEN_WEEK_SCHEDULE = {
    # понедельник
    'mon': (
        "1️⃣ пара (8:15 – 9:00 | 9:10 – 9:55)\n"
        "🎓 Иностранный язык в профессиональной деятельности\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 103У \n\n"
        "2️⃣ пара (10:05 – 11:05 | 11:35 – 12:05)\n"
        "🔠 Дискретная математика\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 304У\n\n"        
        "3️⃣ пара (12:15 – 13:00 | Без перерыва)\n"
        "🕓 Классный час\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 201У\n\n"
            ),

    # вторник
    'tue': (
        "1️⃣ пара (8:15 – 9:00 | 9:10 – 9:55)\n"
        "👨🏻‍💻 Информационные технологии\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 211М\n\n"
        "2️⃣ пара (10:05 – 10:55 | 11:25 – 12:05)\n"
        "🔑 Основы алгоритмизации и программирования\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 204М\n\n"
        "3️⃣ пара (12:15 – 13:00 | 13:10 – 13:55)\n"
        "🌾 Русский язык в профессиональной деятельности\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 209У\n\n"
        "4️⃣ пара (12:15 – 13:00 | 13:10 – 13:55)\n"
        "🌾 Русский язык в профессиональной деятельности\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 209У\n\n"
    ),    
    # среда
    'wed': (
        "2️⃣ пара (10:05 – 10:55 | 11:25 – 12:05)\n"
        "🏃 Физическая культура\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | Спортивный зал \n\n"
        "3️⃣ пара (12:15 – 13:00 | 13:10 – 13:55)\n"
        "🖥️ Операционные системы и среды\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 211М\n\n"        
        "4️⃣ пара (14:15 – 15:00 | 15:10 – 15:55)\n"
        "🖥️ Операционные системы и среды\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 211М\n\n"
            ),

    # четверг
    'thu': (
        "4️⃣ пара (14:15 – 15:00 | 15:10 – 15:55)\n"
        "👨🏻‍💻 Информационные технологии\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 211М\n\n"
        "5️⃣ пара (16:05 – 16:50 | 17:00 – 17:45)\n"
        "🖥️ Операционные системы и среды\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 211М\n\n"        
            ),
    # пятница
    'fri': (
        "1️⃣ пара (8:15 – 9:00 | 9:10 – 9:55)\n"
        "🔑 Основы алгоритмизации и программирования\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 204М\n\n"
        "2️⃣ пара (10:05 – 10:55 | 11:25 – 12:05)\n"
        "🔠 Дискретная математика\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 304У\n\n"
        "3️⃣ пара (12:15 – 13:00 | 13:10 – 13:55)\n"
        "📖 История\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 101О\n\n"
    ),    
    # суббота
    'sat': (
        "1️⃣ пара (8:15 – 9:00 | 9:10 – 9:55)\n"
        "🧩 Элементы высшей математики\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 201У\n\n"
        "2️⃣ пара (10:05 – 10:55 | 11:25 – 12:05)\n"
        "🧩 Элементы высшей математики\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 201У\n\n"
           ), 
}

#* НЕЧЕТНАЯ НЕДЕЛЯ
ODD_WEEK_SCHEDULE = {
    # понедельник
    'mon': (
        "1️⃣ пара (8:15 – 9:00 | 9:10 – 9:55)\n"
        " Иностранный язык в профессиональной деятельности\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 103У \n\n"
        "2️⃣ пара (10:05 – 11:05 | 11:35 – 12:05)\n"
        "🔠 Дискретная математика\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 304У\n\n"        
        "3️⃣ пара (12:15 – 13:00 | Без перерыва)\n"
        "🕓 Классный час\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 201У\n\n"
            ),

    # вторник
    'tue': (
        "1️⃣ пара (8:15 – 9:00 | 9:10 – 9:55)\n"
        "👨🏻‍💻 Информационные технологии\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 211М\n\n"
        "2️⃣ пара (10:05 – 10:55 | 11:25 – 12:05)\n"
        "🔑 Основы алгоритмизации и программирования\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 204М\n\n"
        "3️⃣ пар (12:15 – 13:00 | 13:10 – 13:55)\n"
        "🌾 Русский язык в профессиональной деятельности\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 209У\n\n"
    ),    
    # среда
    'wed': (
        "2️⃣ пара (10:05 – 10:55 | 11:25 – 12:05)\n"
        "🏃 Физическая культура\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | Спортивный зал \n\n"
        "3️⃣ пара (12:15 – 13:00 | 13:10 – 13:55)\n"
        "🖥️ Операционные системы и среды\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 211М\n\n"        
        "4️⃣ пара (14:15 – 15:00 | 15:10 – 15:55)\n"
        "🖥️ Операционные системы и среды\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 211М\n\n"
        "5️⃣ пара (16:05 – 16:50 | 17:00 – 17:45)\n"
        "📖 История\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 101О\n\n"
            ),
    # четверг
    'thu': (
        "4️⃣ пара (14:15 – 15:00 | 15:10 – 15:55)\n"
        "👨‍💻 Информационные технологии\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 211М\n\n"
        "5️⃣ пара (16:05 – 16:50 | 17:00 – 17:45)\n"
        "🖥️ Операционные системы и среды\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 211М\n\n"        
            ),
    # пятница
    'fri': (
        "1️⃣ пара (8:15 – 9:00 | 9:10 – 9:55)\n"
        "🔑 Основы алгоритмизации и программирования\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 204М\n\n"
        "2️⃣ пара (10:05 – 10:55 | 11:25 – 12:05)\n"
        "🔠 Дискретная математика\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 304У\n\n"
        "3️⃣ пара (12:15 – 13:00 | 13:10 – 13:55)\n"
        "📖 История\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 101О\n\n"
    ),    
    # суббота
    'sat': (
        "1️⃣ пара (8:15 – 9:00 | 9:10 – 9:55)\n"
        "🧩 Элементы высшей математики\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 201У\n\n"
        "2️⃣ пара (10:05 – 10:55 | 11:25 – 12:05)\n"
        "🧩 Элементы высшей математики\n"
        "👩‍🏫 Фамилия Имя Отчество\n"
        "🏢 Кабинет | 201У\n\n"
           ),    
}